Meeting-Notes/2021-10-16-meeting.org
* Computing Magic Meeting Notes, Saturday 9 October 2021

Notes from the [[https://github.com/GregDavidson/computing-magic][Computing Magic Project]].

** What should you do between Now and Next Saturday?

Continue exploring the tutorial [[https://docs.racket-lang.org/continue/index.html][Web Applications in Racket]]!
- If you run into a roadblock, share on our Discord's #computing-magic channel
- The goal is to finish the tutorial this week, but we'll see!

Continue exploring the [[https://github.com/GregDavidson/on-lisp/blob/main/vis-mce.rkt][Meta-Circular Evaluator]].
- Is it giving you insight into how Lisps work?
- Can you make it do any new tricks?
- Share what you're discovering on our #computing-magic channel

** What's coming up next?

After we finish the Web tutorial - which covers much more than mere Web
Applications, of course! - we're going to start moving to a complete computing
environment. Racket will be our front-end language but we'll shift away from
DrRacket towards a more complete development environment.  We'll learn an
extensible, object-relational database and we'll start to put everything we've
learned and everything we will be learning into an integrated framework.

** Notes from Today's Session

Various things came up from attempts to work through the Web tutorial which led
to some interesting mini-presentations and discussions which will be captured
here.

*** Support for the Tutorial

The tutorial uses the special racket language
#+begin_src racket
#lang web-server/insta
#+end_src
which automagically pulls in a number of racket packages
and sets things up so that when you define a procedure named =start=, it will
1. Create a simple Web Server in Racket
2. Fire up your default browser connected to the Racket Web Server
3. Call the procedure you named =start= with the browser's =request=
4. Send a response to your browser
 
The purpose of all of this is so that the tutorial can start you out with a
working web server in only this much code:
#+begin_src racket
#lang web-server/insta
(define (start request)
  (response/xexpr
   '(html
     (head (title "My Blog"))
     (body (h1 "Under construction")))))
#+end_src
and then incrementally refine it.

The problem is that so much is being hidden that it can be hard to know what's
going on!

I recommend following the tutorial as written, but I provide you with a companion
Racket program which makes things a bit more explicit: [[https://github.com/GregDavidson/computing-magic/blob/main/web-play.rkt][web-play.rkt]]
- Download it, run it, and play with it a bit!

**** xexpr, contracts and all that

Hopefully the use of the /xexpr/ notation in the tutorial is clear by example,
i.e. that we work with /html/ and /xml/ using expressions like
#+begin_src racket
'(div ((class "post")) "First post!" (p "This is a first post."))
#+end_src
which will be converted automagically to regular /html/ or /xml/ like this
#+begin_src html
<div class="post">First post!<p>This is a first post.</p></div>
#+end_src

The precise definition of the xexpr notation is given by the recursive contract 
#+begin_src racket
(define xexpr/c
  (flat-rec-contract
   xexpr
   (or/c string?
         (cons/c symbol? (listof xexpr))
         (cons/c symbol?
                 (cons/c (listof (list/c symbol? string?))
                         (listof xexpr))))))
#+end_src

which is automatically brought in by the framework: you aren't supposed to put
this in your program and you don't have to fully understand it!

