Meeting-Notes/2021-10-16-meeting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-16 Sat 23:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Greg Davidson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org875fbe9">1. Computing Magic Meeting Notes, Saturday 9 October 2021</a>
<ul>
<li><a href="#org08fa3a0">1.1. What should you do between Now and Next Saturday?</a></li>
<li><a href="#orga8caa57">1.2. What's coming up next?</a></li>
<li><a href="#orgc4f4e76">1.3. Notes from Today's Session</a>
<ul>
<li><a href="#org12d8e31">1.3.1. Support for the Tutorial</a></li>
<li><a href="#org5853f32">1.3.2. Declarative vs. Procedural</a></li>
<li><a href="#orgadf79ad">1.3.3. Imperative vs. Functional</a></li>
<li><a href="#orgf875298">1.3.4. Review of struct</a></li>
<li><a href="#orgd802831">1.3.5. Review of Cons, Lists, Quasiquotes</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org875fbe9" class="outline-2">
<h2 id="org875fbe9"><span class="section-number-2">1</span> Computing Magic Meeting Notes, Saturday 9 October 2021</h2>
<div class="outline-text-2" id="text-1">
<p>
Notes from the <a href="https://github.com/GregDavidson/computing-magic">Computing Magic Project</a>.
</p>
</div>

<div id="outline-container-org08fa3a0" class="outline-3">
<h3 id="org08fa3a0"><span class="section-number-3">1.1</span> What should you do between Now and Next Saturday?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Continue exploring the tutorial <a href="https://docs.racket-lang.org/continue/index.html">Web Applications in Racket</a>!
</p>
<ul class="org-ul">
<li>If you run into a roadblock, share on our Discord's #computing-magic channel</li>
<li>The goal is to finish the tutorial this week, but we'll see!</li>
</ul>

<p>
Continue exploring the <a href="https://github.com/GregDavidson/on-lisp/blob/main/vis-mce.rkt">Meta-Circular Evaluator</a>.
</p>
<ul class="org-ul">
<li>Is it giving you insight into how Lisps work?</li>
<li>Can you make it do any new tricks?</li>
<li>Share what you're discovering on our #computing-magic channel</li>
</ul>
</div>
</div>

<div id="outline-container-orga8caa57" class="outline-3">
<h3 id="orga8caa57"><span class="section-number-3">1.2</span> What's coming up next?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
After we finish the Web tutorial - which covers much more than mere Web
Appplications, of course! - we're going to start moving to a complete computing
environment. Racket will be our front-end language but we'll shift away from
DrRacket towards a more complete development environment.  We'll learn an
extensible, object-relational database and we'll start to put everything we've
learned and everything we will be learning into an integrated framework.
</p>
</div>
</div>

<div id="outline-container-orgc4f4e76" class="outline-3">
<h3 id="orgc4f4e76"><span class="section-number-3">1.3</span> Notes from Today's Session</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Various things came up from attempts to work through the Web tutorial which led
to some interesting mini-presentations and discussions which will be captured
here.
</p>
</div>

<div id="outline-container-org12d8e31" class="outline-4">
<h4 id="org12d8e31"><span class="section-number-4">1.3.1</span> Support for the Tutorial</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
The tutorial uses the special racket language
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3; font-weight: bold;">#lang</span> <span style="color: #715ab1;">web-server/insta</span>
</pre>
</div>
<p>
which automagically pulls in a number of racket packages
and sets things up so that when you define a procedure named <code>start</code>, it will
</p>
<ol class="org-ol">
<li>Create a simple Web Server in Racket</li>
<li>Fire up your default browser connected to the Racket Web Server</li>
<li>Call the procedure you named <code>start</code> with the browser's <code>request</code></li>
<li>Send a response to your browser</li>
</ol>

<p>
The purpose of all of this is so that the tutorial can start you out with a
working web server in only this much code:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3; font-weight: bold;">#lang</span> <span style="color: #715ab1;">web-server/insta</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #6c3163;">(</span><span style="color: #6c3163; font-weight: bold;">start</span> request<span style="color: #6c3163;">)</span>
  <span style="color: #6c3163;">(</span>response/xexpr
   '<span style="color: #2d9574;">(</span>html
     <span style="color: #67b11d;">(</span>head <span style="color: #b1951d;">(</span>title <span style="color: #2d9574;">"My Blog"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span>body <span style="color: #b1951d;">(</span>h1 <span style="color: #2d9574;">"Under construction"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
and then incrementally refine it.
</p>

<p>
The problem is that so much is being hidden that it can be hard to know what's
going on!
</p>

<p>
I recommend following the tutorial as written, but I provide you with a companion
Racket program which makes things a bit more explicit: <a href="https://github.com/GregDavidson/computing-magic/blob/main/web-play.rkt">web-play.rkt</a>
</p>
<ul class="org-ul">
<li>Download it, run it, and play with it a bit!</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orged50d93"></a>xexpr, contracts and all that<br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
Hopefully the use of the <i>xexpr</i> notation in the tutorial is clear by example,
i.e. that we work with <i>html</i> and <i>xml</i> using expresions like
</p>
<div class="org-src-container">
<pre class="src src-racket">'<span style="color: #3a81c3;">(</span>div <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span><span style="color: #3a81c3;">class</span> <span style="color: #2d9574;">"post"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span> <span style="color: #2d9574;">"First post!"</span> <span style="color: #6c3163;">(</span>p <span style="color: #2d9574;">"This is a first post."</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
which will be converted automagically to regular <i>html</i> or <i>xml</i> like this
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #6c3163; font-weight: bold;">div</span> <span style="color: #715ab1;">class</span>=<span style="color: #2d9574;">"post"</span>&gt;First post!&lt;<span style="color: #6c3163; font-weight: bold;">p</span>&gt;This is a first post.&lt;/<span style="color: #6c3163; font-weight: bold;">p</span>&gt;&lt;/<span style="color: #6c3163; font-weight: bold;">div</span>&gt;
</pre>
</div>

<p>
The precise definition of the xexpr notation is given by the recursive contract 
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">xexpr/c</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">flat-rec-contract</span>
   xexpr
   <span style="color: #2d9574;">(</span><span style="color: #3a81c3;">or/c</span> <span style="color: #3a81c3;">string?</span>
         <span style="color: #67b11d;">(</span><span style="color: #3a81c3;">cons/c</span> <span style="color: #3a81c3;">symbol?</span> <span style="color: #b1951d;">(</span><span style="color: #3a81c3;">listof</span> xexpr<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span><span style="color: #3a81c3;">cons/c</span> <span style="color: #3a81c3;">symbol?</span>
                 <span style="color: #b1951d;">(</span><span style="color: #3a81c3;">cons/c</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">listof</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">list/c</span> <span style="color: #3a81c3;">symbol?</span> <span style="color: #3a81c3;">string?</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
                         <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">listof</span> xexpr<span style="color: #3a81c3;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
which is automatically brought in by the framework: you aren't supposed to put
this in your program and you don't have to fully understand it!
</p>
</div>
</li>
</ol>
</div>
