Meeting-Notes/2021-10-16-meeting.org
*** Declarative vs. Procedural 

Computers are wired to perform computation by executing large numbers of very
simple operations (computational steps) very fast. Machine-code programs consist
of sequences of instructions which correspond to these hard-wired operations.
Assembly Language gives symbolic names to the bit-patterns of machine code,
allowing human beings to better understand them.

Example from x86/IA-32 machine code:
- intention :: put the value 97 (hexadecimal 61) into register AL
- instruction in binary :: 10110000 01100001
- same instruction in hexadecimal :: B0 61
- same instruction in assembly language :: MV AL, 61h

Higher-level procedural languages can specify these operations in larger
computational steps. These steps can then either be incrementally decoded and
performed by an /interpreter/ program or translated by a /compiler/ program into
machine code which can then be executed directly by the machine. Programs run by
an interpreter usually run 10 to 100 times slower than programs translated into
machine code - we don't usually count the time it takes the compiler to do the
translation though, since that can be amortized over many executions of the
program.

In *Procedural Programming*, the human programmer writes a program in either a
high-level or low-level procedural language. In other words, the programmer
specifies the computational steps the program will perform to solve some
specified problem. High-Level Languages make Procedural Programming much easier
than it used to be. However, the resulting program is often very complex, needs
commentary for humans to understand its intent and often contains bugs which
cause it to fail to work as intended. In Procedural Programming, programmers
spend much more time testing their program trying to find bugs and then
debugging their program than they spend writing the program in the first case.

In *Declarative Programming*, the human programmer writes a specification of
what they want the program to do, but without saying how the program should
accomplish it. An automatic programming system then synthesizes a procedure for
carrying out the programmer's intent.

Declarative programming systems include:
- Formulas in Spreadsheets
- SQL in Relational Databases
- Pattern matching with Regular expressions
- etc.

-- Given table =weather= with these rows:

| city          | temp_lo | temp_hi | prcp |       date |
|---------------+---------+---------+------+------------|
| San Francisco |      46 |      50 | 0.25 | 1994-11-27 |
| San Francisco |      43 |      57 |    0 | 1994-11-29 |
| Hayward       |      37 |      54 |      | 1994-11-29 |

#+begin_src sql
-- get the maximum low temperature observed in each city
SELECT city, max(temp_lo)
    FROM weather
    GROUP BY city;
#+end_src

returns

| city          | max |
|---------------+-----|
| Hayward       |  37 |
| San Francisco |  46 |

Exercise to the reader: Try writing a procedural program to do this in your
favorite language. What are the pros and cons?

When a Declarative Programming Language matches a problem domain well it can be
enormously more productive for programmers. The program specification is short
and closely related to the domain. The automatically generated program is
guaranteed to be correct - although the specification might be wrong, so some
testing might still be a good idea.

The biggest potential drawback of Declarative Programming is if the
automatically generated procedural program is inefficient. Declarative
programmers have to understand the limitations of their tools. Different ways of
stating the specification can produce very differently performing programs!

*** Imperative vs. Functional

/Imperative Programs/ view memory as consisting of modifiable variables and
modifiable data structures. Imperative programs consist of a series of
statements which
1. Read in input data into memory in some convenient arrangement
2. Modify memory until desired results appear
3. Write out the results to a desired output device 

/Functional Programs/ consist of /Functional Procedures/. Each Functional
Procedure computes 1 or more output values from 1 or more input arguments. As in
a mathematical function, the same result(s) will always be produced given the
same arguments.  Functional Procedures have no /side-effect/.

/Side-Effects/ of running an Imperative Procedure include
1. Modification of memory outside of the Procedure
2. Reading data from an Input Device 
3. Writing data to an Output Device

The order in which Statements and Procedures are called in /Imperative
Procedures/ will typically change the result of the program.

The order in which Procedures are called in a purely Functional Program may
affect the efficiency of the program, but will not change its results.

Some programming languages, such as /Haskell/ and /Agda/, only allow expressing
Functional Programs. Programming in such languages is very good training in
learning how to write short, clear, efficient programs which need little to no
debugging.

Lisps are hybrid languages. Lisps are very good at expressing Functional
Programs but also allow programmers to write /Imperative Code/. Great Lisp
programmers are careful to keep their programs mostly Functional and to
carefully document and justify any imperative code in their programs.

If you're feeling ambitious, study this example of [[https://github.com/GregDavidson/on-lisp/blob/main/wierd-closures.rkt][wierd-closures.rkt]].

