Meeting-Notes/2021-10-16-meeting.html

<div id="outline-container-org5853f32" class="outline-4">
<h4 id="org5853f32"><span class="section-number-4">1.3.2</span> Declarative vs. Procedural</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Computers are wired to perform computation by executing large numbers of very
simple operations (computational steps) very fast. Machine-code programs consist
of sequences of instructions which correspond to these hard-wired operations.
Assembly Language gives symbolic names to the bit-patterns of machine code,
allowing human beings to better understand them.
</p>

<p>
Example from x86/IA-32 machine code:
</p>
<dl class="org-dl">
<dt>intention</dt><dd>put the value 97 (hexadecimal 61) into register AL</dd>
<dt>instruction in binary</dt><dd>10110000 01100001</dd>
<dt>same instruction in hexadecimal</dt><dd>B0 61</dd>
<dt>same instruction in assembly language</dt><dd>MV AL, 61h</dd>
</dl>

<p>
Higher-level procedural languages can specify these operations in larger
computational steps. These steps can then either be incrementally decoded and
performed by an <i>interpreter</i> program or translated by a <i>compiler</i> program into
machine code which can then be executed directly by the machine. Programs run by
an interpreter usually run 10 to 100 times slower than programs translated into
machine code - we don't usually count the time it takes the compiler to do the
translation though, since that can be amortized over many executions of the
program.
</p>

<p>
In <b>Procedural Programming</b>, the human programmer writes a program in either a
high-level or low-level procedural language. In other words, the programmer
specifies the computational steps the program will perform to solve some
specified problem. High-Level Languages make Procedural Programming much easier
than it used to be. However, the resulting program is often very complex, needs
commentary for humans to understand its intent and often contains bugs which
cause it to fail to work as intended. In Procedural Programing, programmers
spend much more time testing their program trying to find bugs and then
debugging their program than they spent writing the program in the first case.
</p>

<p>
In <b>Declarative Programming</b>, the human programmer writes a specification of
what they want the program to do, but without saying how the program should
accomplish it. An automatic programming system then synthesizes a procedure for
carrying out the programmer's intent.
</p>

<p>
Declarative programming systems include:
</p>
<ul class="org-ul">
<li>Formulas in Spreadsheets</li>
<li>SQL in Relational Databases</li>
<li>Pattern matching with Regular expressions</li>
<li>etc.</li>
</ul>

<p>
&#x2013; Given table weather with these rows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">city</th>
<th scope="col" class="org-right">temp<sub>lo</sub></th>
<th scope="col" class="org-right">temp<sub>hi</sub></th>
<th scope="col" class="org-right">prcp</th>
<th scope="col" class="org-right">date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">46</td>
<td class="org-right">50</td>
<td class="org-right">0.25</td>
<td class="org-right">1994-11-27</td>
</tr>

<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">43</td>
<td class="org-right">57</td>
<td class="org-right">0</td>
<td class="org-right">1994-11-29</td>
</tr>

<tr>
<td class="org-left">Hayward</td>
<td class="org-right">37</td>
<td class="org-right">54</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1994-11-29</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #2aa1ae; background-color: #ecf3ec;">-- get the maximum low temperature observed in each city</span>
<span style="color: #3a81c3; font-weight: bold;">SELECT</span> city, <span style="color: #3a81c3;">max</span><span style="color: #3a81c3;">(</span>temp_lo<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">FROM</span> weather
    <span style="color: #3a81c3; font-weight: bold;">GROUP</span> <span style="color: #3a81c3; font-weight: bold;">BY</span> city;
</pre>
</div>

<p>
returns
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">city</th>
<th scope="col" class="org-right">max</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Hayward</td>
<td class="org-right">37</td>
</tr>

<tr>
<td class="org-left">San Francisco</td>
<td class="org-right">46</td>
</tr>
</tbody>
</table>


<p>
Exercise to the reader: Try writing a procedural program to do this in your
favorite language. What are the pros and cons?
</p>

<p>
When a Declarative Programming Language matches a problem domain well it can be
enormously more productive for programmers. The program specification is short
and closely related to the domain. The automatically generated program is
guaranteed to be correct - although the specification might be wrong, so some
testing might still be a good idea.
</p>

<p>
The biggest potential drawback of Declarative Programming is if the
automatically generated procedural program is inefficient. Declarative
programmers have to understand the limitations of their tools. Different ways of
stating the specification can produce very differently performing programs!
</p>
</div>
</div>

<div id="outline-container-orgadf79ad" class="outline-4">
<h4 id="orgadf79ad"><span class="section-number-4">1.3.3</span> Imperative vs. Functional</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
<i>Imperative Programs</i> view memory as consisting of modifiable variables and
modifiable data structures. Imperative programs consist of a series of
statements which
</p>
<ol class="org-ol">
<li>Read in input data into memory in some convenient arrangment</li>
<li>Modify memory until desired results appear</li>
<li>Write out the results to a desired output device</li>
</ol>

<p>
<i>Functional Programs</i> consist of <i>Functional Procedures</i>. Each Functional
Procedure computes 1 or more output values from 1 or more input arguments. As in
a mathematical function, the same result(s) will always be produced given the
same arguments.  Functional Procedures have no <i>side-effect</i>.
</p>

<p>
<i>Side-Effects</i> of running an Imperative Procedure include
</p>
<ol class="org-ol">
<li>Modification of memory outside of the Procedure</li>
<li>Reading data from an Input Device</li>
<li>Writing data to an Output Device</li>
</ol>

<p>
The order in which Statements and Procedures are called in <i>Imperative
Procedures</i> will typically change the result of the program.
</p>

<p>
The order in which Procedures are called in a purely Functional Program may
affect the efficiency of the program, but will not change its results.
</p>

<p>
Some programming languages, such as <i>Haskell</i> and <i>Agda</i>, only allow expressing
Functional Programs. Programming in such languages is very good training in
learning how to write short, clear, efficient programs which need little to no
debugging.
</p>

<p>
Lisps are hybrid languages. Lisps are very good at expressing Functional
Programs but also allow programmers to write <i>Imperative Code</i>. Great Lisp
programmers are careful to keep their programs mostly Functional and to
carefully document and justify any imperative code in their programs.
</p>
</div>
</div>
