Meeting-Notes/2021-10-16-meeting.org
*** Review of struct

The simplest use of =struct= is to wrap up one or more values into
a composite object which will have a brand new and distinct datatype.

#+begin_src racket
(struct post (title body)
; Creates a new type, distinct from all others
; Creates functions post, post?, post-title, post-body

; procedure post is the constructor,
; the only procedure that can create posts
(define a-post (post "Some Title" "Something about it"))
> a-post
#<post> ; an opaque object

; post? is a type predicate, returning #t = true for posts
> (post? a-post) ; is a-post bound to a post?
#t
; and #f = false for anything not created by procedure post
> (post? "Anything else")
#f

; Posts can be destructured by selectors
; struct creates a selector for each named field:
> (post-title a-post)
"Some Title"
> (post-body a-post)
"Something about it"
#+end_src

*** Review of Cons, Lists, Quasiquotes

**** Pairs aka Cons Cells

In a more modern languages, pairs (representing a pair of values) and lists
(representing a sequence of values) would be distinct types. In Lisp these two
concepts overlap.

Procedure =cons= creates pairs
#+begin_src racket
; the pair constructor is function cons
> (cons 'this 'that)
'(this . that)
> (define a-pair (cons 'this 'that))
> a-pair
'(this . that)
> (pair? a-pair)
#t
> (pair? "hello world")
#f
; the destructors are car and cdr
> (car a-pair)
'this
> (cdr a-pair)
'that
#+end_src

Notice that pairs have a syntax similar to a list, except with a dot between the
two components.

Pairs are also called "cons cells".  If pairs didn't exist in Racket we could create almost the same thing by saying 
#+begin_src racket
(struct pair (car cdr)
#+end_src
- How would these pairs be different?
- Could we fix it up to make them behave identically to cons cells?

