Meeting-Notes/2021-10-16-meeting.html

<div id="outline-container-orgf875298" class="outline-4">
<h4 id="orgf875298"><span class="section-number-4">1.3.4</span> Review of struct</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
The simplest use of <code>struct</code> is to wrap up one or more values into
a composite object which will have a brand new and distinct datatype.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">struct</span> post <span style="color: #6c3163;">(</span>title body<span style="color: #6c3163;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Creates a new type, distinct from all others</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Creates functions post, post?, post-title, post-body</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">procedure post is the constructor,</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">the only procedure that can create posts</span>
<span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">a-post</span> <span style="color: #2d9574;">(</span>post <span style="color: #2d9574;">"Some Title"</span> <span style="color: #2d9574;">"Something about it"</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">&gt;</span> a-post
#&lt;post&gt; <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">an opaque object</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">post? is a type predicate, returning #t = true for posts</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span>post? a-post<span style="color: #6c3163;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">is a-post bound to a post?</span>
<span style="color: #2e8b57;">#t</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">and #f = false for anything not created by procedure post</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span>post? <span style="color: #2d9574;">"Anything other th"</span><span style="color: #6c3163;">)</span>
<span style="color: #2e8b57;">#f</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">#f = false</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Posts can be deconstructed by selectors</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">struct creates a selector for each named field:</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span>post-title a-post<span style="color: #6c3163;">)</span>
<span style="color: #2d9574;">"Some Title"</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span>post-body a-post<span style="color: #6c3163;">)</span>
<span style="color: #2d9574;">"Something about it"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd802831" class="outline-4">
<h4 id="orgd802831"><span class="section-number-4">1.3.5</span> Review of Cons, Lists, Quasiquotes</h4>
<div class="outline-text-4" id="text-1-3-5">
</div>
<ol class="org-ol">
<li><a id="org250d9a1"></a>Pairs aka Cons Cells<br />
<div class="outline-text-5" id="text-1-3-5-1">
<p>
In a more modern languages, pairs (representing a pair of values) and lists
(representing a sequence of values) would be distinct types. In Lisp these two
concepts overlap.
</p>

<p>
Procedure <code>cons</code> creates pairs
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">the pair constructor is function cons</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">cons</span> <span style="color: #2e8b57;">'this</span> <span style="color: #2e8b57;">'that</span><span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">this</span> . that<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">a-pair</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">cons</span> <span style="color: #2e8b57;">'this</span> <span style="color: #2e8b57;">'that</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> a-pair
'<span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">this</span> . that<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">pair?</span> a-pair<span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">#t</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">pair?</span> <span style="color: #2d9574;">"hello world"</span><span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">#f</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">the destructors are car and cdr</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">car</span> a-pair<span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">'this</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">cdr</span> a-pair<span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">'that</span>
</pre>
</div>

<p>
Notice that pairs have a syntax similar to a list, except with a dot between the
two components.
</p>

<p>
Pairs are also called "cons cells".  If pairs didn't exist in Racket we could create almost the same thing by saying 
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">struct</span> pair <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">car</span> <span style="color: #3a81c3;">cdr</span><span style="color: #6c3163;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>How would these pairs be different?</li>
<li>Could we fix it up to make them behave identically to cons cells?</li>
</ul>
</div>
</li>
