Meeting-Notes/2021-10-16-meeting.org
**** Lists

A /list/ is either the empty list =()= or a sequence of /pairs/ where the /car/
of each pair is a list element and the =cdr= of each pair is the /rest of the
list/.

Lists can be created either by =list= or nested =cons= forms. Literal lists can
be entered using ' (quote) with list or pair syntax. Lists can be arbitrarily nested.

#+begin_src racket
> (list 'one 'two 'three)
'(one two three)
> (cons 'one (cons 'two (cons 'three '())))
'(one two three)
> '(one two three) ; a list literal
'(one two three)
> '(one . (two . (three . ()))) ; three nested pair literals
'(one two three) ; produces the same result!
#+end_src

Since Lists are really just a sequence of pairs, they can be destructured with
=car= and =cons=.

#+begin_src racket
> (define shopping '(bread (1 gallon milk) (some fruit))
> shopping
'(bread (1 gallon milk) (some fruit))
> (pair? shopping)
#t
> (car shopping)
bread
> (cdr shopping)
'((1 gallon milk) (some fruit))
> (car (cdr shopping))
'(1 gallon milk)
> (cons 'grapes shopping)
'(grapes bread (1 gallon milk) (some fruit))
> shopping
'(bread (1 gallon milk) (some fruit))
#+end_src

There's a special predicate for empty lists
#+begin_src racket
> (null? '())
#t
> (null? '(1 2 3))
#f
#+end_src

And a variety of other handy procedures
#+begin_src racket
> (define a-list '(1 2 3))
> (length a-list)
3
> (append a-list '(a b c))
'(1 2 3 a b c)
; which doesn't change a-list, of course
> a-list
'(1 2 3)
#+end_src

**** Quasiquotes

Everything inside of a quoted list is also quoted.  Quasiquotes let us
splice computed values into an otherwise literal list structure.

#+begin_src racket
; quasiquotes use the backwards quote symbol 
; quasiquote seems to work just like regular quote
(define milk `(2 liters milk))
> `(bread milk fruit)
'(bread milk fruit)
; but we can selectively evaluate elements
> `(bread ,milk fruit)
'(bread (2 liters milk) fruit)
; and even splice in a sublist
> `(bread ,@milk fruit)
'(bread 2 liters milk fruit)
#+end_src

It's just syntactic sugar performed by the Racket Reader. Without it we could write

#+begin_src racket
(define milk '(2 liters milk))
> (list 'bread milk 'fruit)
'(bread (2 liters milk) fruit)
> (cons 'bread (append milk '(fruit)))
'(bread 2 liters milk fruit)
#+end_src
