Meeting-Notes/2021-10-16-meeting.html

<li><a id="orgc7b1c47"></a>Lists<br />
<div class="outline-text-5" id="text-1-3-5-2">
<p>
A <i>list</i> is either the empty list <code>()</code> or a sequence of <i>pairs</i> where the <i>car</i>
of each pair is a list element and the <code>cdr</code> each pair is the <i>rest of the
list</i>.
</p>

<p>
Lists can be created either by <code>list</code> or nested <code>cons</code> forms. Literal lists can
be with list or pair syntax. Lists can be arbitarily nested.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">list</span> <span style="color: #2e8b57;">'one</span> <span style="color: #2e8b57;">'two</span> <span style="color: #2e8b57;">'three</span><span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span>one two three<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">cons</span> <span style="color: #2e8b57;">'one</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">cons</span> <span style="color: #2e8b57;">'two</span> <span style="color: #2d9574;">(</span><span style="color: #3a81c3;">cons</span> <span style="color: #2e8b57;">'three</span> '<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span>one two three<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> '<span style="color: #3a81c3;">(</span>one two three<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">a list literal</span>
'<span style="color: #3a81c3;">(</span>one two three<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> '<span style="color: #3a81c3;">(</span>one . <span style="color: #6c3163;">(</span>two . <span style="color: #2d9574;">(</span>three . <span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">three nested pair literals</span>
'<span style="color: #3a81c3;">(</span>one two three<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">produces the same result!</span>
</pre>
</div>

<p>
Since Lists are really just a sequence of pairs, they can be deconstructed with
<code>car</code> and <code>cons</code>.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">shopping</span> '<span style="color: #6c3163;">(</span>bread <span style="color: #2d9574;">(</span><span style="color: #4e3163;">1</span> gallon milk<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>some fruit<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">&gt;</span> shopping
'<span style="color: #6c3163;">(</span>bread <span style="color: #2d9574;">(</span><span style="color: #4e3163;">1</span> gallon milk<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>some fruit<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">pair?</span> shopping<span style="color: #6c3163;">)</span>
<span style="color: #2e8b57;">#t</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">car</span> shopping<span style="color: #6c3163;">)</span>
bread
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">cdr</span> shopping<span style="color: #6c3163;">)</span>
'<span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span><span style="color: #4e3163;">1</span> gallon milk<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>some fruit<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">car</span> <span style="color: #2d9574;">(</span><span style="color: #3a81c3;">cdr</span> shopping<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
'<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span> gallon milk<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #6c3163;">(</span><span style="color: #3a81c3;">cons</span> <span style="color: #2e8b57;">'grapes</span> shopping<span style="color: #6c3163;">)</span>
'<span style="color: #6c3163;">(</span>grapes bread <span style="color: #2d9574;">(</span><span style="color: #4e3163;">1</span> gallon milk<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>some fruit<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">&gt;</span> shopping
'<span style="color: #6c3163;">(</span>bread <span style="color: #2d9574;">(</span><span style="color: #4e3163;">1</span> gallon milk<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>some fruit<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span>
</pre>
</div>

<p>
There's a special predicate for empty lists
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">null?</span> '<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">#t</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">null?</span> '<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2e8b57;">#f</span>
</pre>
</div>

<p>
And a variety of other handy procedures
</p>
<div class="org-src-container">
<pre class="src src-racket"><span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">a-list</span> '<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">length</span> a-list<span style="color: #3a81c3;">)</span>
<span style="color: #4e3163;">3</span>
<span style="color: #3a81c3;">&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">append</span> a-list '<span style="color: #6c3163;">(</span>a b c<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span> a b c<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">which doesn't change a-list, of course</span>
<span style="color: #3a81c3;">&gt;</span> a-list
'<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span> <span style="color: #4e3163;">3</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org251f1f8"></a>Quasiquotes<br />
<div class="outline-text-5" id="text-1-3-5-3">
<p>
Everything inside of a quoted list is also quoted.  Quasiquotes let us
splice computed values into an otherwise literal list structure.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">quasiquotes use the backwards quote symbol </span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">define</span> <span style="color: #715ab1;">milk</span> '<span style="color: #6c3163;">(</span><span style="color: #4e3163;">2</span> liters milk<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">quasiquote seems to work just like regular quote</span>
<span style="color: #3a81c3;">&gt;</span> `<span style="color: #3a81c3;">(</span>bread milk fruit<span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span>bread milk fruit<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">but we can selectively evaluate elements</span>
<span style="color: #3a81c3;">&gt;</span> `<span style="color: #3a81c3;">(</span>bread ,milk fruit<span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span>bread <span style="color: #6c3163;">(</span><span style="color: #4e3163;">2</span> liters milk<span style="color: #6c3163;">)</span> fruit<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">and even splice in a sublist</span>
<span style="color: #3a81c3;">&gt;</span> `<span style="color: #3a81c3;">(</span>bread ,@milk fruit<span style="color: #3a81c3;">)</span>
'<span style="color: #3a81c3;">(</span>bread <span style="color: #4e3163;">2</span> liters milk fruit<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Greg Davidson</p>
<p class="date">Created: 2021-10-16 Sat 23:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
